angular.module('infi-basic')
    .controller('explorationsController',[ '$scope',function ($scope) {
        $scope.trThree = [
            {name:'属性'},
            {name:'均值'},
            {name:'标准差'},
            {name:'下限'},
            {name:'上限'},
            {name:'中位数'},
            {name:'25'},
            {name:'75'},
            {name:'最小值'},
            {name:'最大值'},
            {name:'均值'},
            {name:'标准差'},
            {name:'下限'},
            {name:'上限'},
            {name:'中位数'},
            {name:'25'},
            {name:'75'},
            {name:'最小值'},
            {name:'最大值'},
            {name:'P值'},
            {name:'方差齐性'}
        ];
        $scope.condition = [
            {name:'性别',active:'',value:"wuxu",data: {
                label:"性别",
                data1:[
                    ['男','385','29.01%'],
                    ['女','942','70.99%']
                ],
                data2:[
                    ['男','279','32.90%'],
                    ['女','569','67.10%']
                ],
                data3:['3.688','0.055','1.200']


            }},
            {name:'高血压',active:'',value:"wuxu",data:{
                label:"高血压",
                data1:[
                    ['0','534','40.24%'],
                    ['1','793','59.76%']
                ],
                data2:[
                    ['0','275','32.43%'],
                    ['1','573','67.57%']
                ],
                data3:['13.516','<0.001','0.713']
            }},
            {name:'高脂血症',active:'',value:"wuxu",data:{
                label:"高脂血症",
                data1:[
                    ['1','1092','82.29%'],
                    ['2','235','17.71%']
                ],
                data2:[
                    ['1','676','79.72%'],
                    ['2','172','20.28%']
                ],
                data3:['2.253','0.133','0.846']
            }},
            {name: '糖尿病',active: '',value:"wuxu",data: {
                label: '糖尿病',
                data1: [
                    ['0','989','74.53%'],
                    ['1','407','48.00%']
                ],
                data2: [
                    ['0','338','25.47%'],
                    ['1','441','52.00%']
                ],
                data3:['158.453','<0.001','0.315']

            }},
            {
                name:"吸烟史",
                active:"",
                value:"wuxu",
                data:{
                    label:"吸烟史",
                    data1:[
                        ['0','746','56.22%'],
                        ['1','504','59.43%']
                    ],
                    data2:[
                        ['0','581','43.78%'],
                        ['1','344','40.57%']
                    ],
                    data3:['2.191','0.139','1.141']
                }
            },
            {
                name:"饮酒史",
                active:"",
                value:"wuxu",
                data:{
                    label:"饮酒史",
                    data1:[
                        ['0','780','58.78%'],
                        ['1','547','41.22%']
                    ],
                    data2:[
                        ['0','522','61.56%'],
                        ['1','326','38.44%']
                    ],
                    data3:['1.661','0.197','1.123']
                }
            },
            {
                name:"阿托伐他汀_是否用药",
                active:"",
                value:"wuxu",
                data:{
                    label:"阿托伐他汀_是否用药",
                    data1:[
                        ['0','371','27.96%'],
                        ['1','211','24.88%']
                    ],
                    data2:[
                        ['0','956','72.04%'],
                        ['1','637','75.12%']
                    ],
                    data3:['2.497','0.114','0.854']
                }
            },
            {
                name:"阿司匹林_是否用药",
                active:"",
                value:"wuxu",
                data:{
                    label:"阿司匹林_是否用药",
                    data1:[
                        ['0','317','23.89%'],
                        ['1','1010','76.11%']
                    ],
                    data2:[
                        ['0','179','21.11%'],
                        ['1','669','78.89%']
                    ],
                    data3:['2.271','0.132','0.852']
                }
            },
            {
                name:"氯吡格雷_是否用药",
                active:"",
                value:"wuxu",
                data:{
                    label:"阿司匹林_是否用药",
                    data1:[
                        ['0','491','37.00%'],
                        ['1','836','63.00%']
                    ],
                    data2:[
                        ['0','281','33.14%'],
                        ['1','567','66.86%']
                    ],
                    data3:['3.374','0.066','0.844']
                }
            },
            {
                name:"阿司匹林_是否用药",
                active:"",
                value:"wuxu",
                data:{
                    label:"阿司匹林_是否用药",
                    data1:[
                        ['0','954','71.89%'],
                        ['1','373','28.11%']
                    ],
                    data2:[
                        ['0','572','67.45%'],
                        ['1','276','32.55%']
                    ],
                    data3:['4.869','0.027','0.810']
                }
            },
            {name:'年龄',active:'',value:"lianxu",data:{
                label:"年龄",
                data1:['年龄','59.15','11.98','58.34','59.96','62.00','54.00','71.00','20.00','95.00'],
                data2:['年龄','61.79','12.79','61.10','62.48','60.00','52.00','66.00','13.00','97.00'],
                data3:['<0.001','方差不齐']
            }},
            {name:'住院天数',value:"lianxu",active:'',data:{
                label:"住院天数",
                data1:['住院天数','10.08','4.50','9.77','10.38','9.00','7.00','12.00','1.00','47.00'],
                data2:['住院天数','9.94','4.71','9.68','10.19','9.00','7.00','12.00','1.00','62.00'],
                data3:['0.490','']

            }},
            {name:'收缩压',value:"lianxu",active:'',data:{
                label:"收缩压",
                data1:['收缩压','147.19','21.59','145.73','148.64','140.00','130.00','159.00','94.00','230.00'],
                data2:['收缩压','143.19','21.46','142.03','144.35','146.50','130.00','160.00','76.00','220.00'],
                data3:['<0.001','']
            }},
            {name:'舒张压',value:"lianxu",active:'',data:{
                label:"舒张压",
                data1:['舒张压','86.05','12.66','85.20','86.91','80.00','75.00','90.00','53.00','140.00'],
                data2:['舒张压','83.19','12.64','82.51','83.87','85.00','80.00','90.00','47.00','141.00'],
                data3:['<0.001','']
            }},
            {name:'身高',value:"lianxu",active:'',data:{
                label:"身高",
                data1:['身高','167.27','7.81','166.74','167.80','170.00','162.00','173.00','130.00','190.00'],
                data2:['身高','167.76','7.43','167.36','168.16','168.50','160.00','173.00','147.00','190.00'],
                data3:['0.144','']
            }},
            {name:'体重',value:"lianxu",active:'',data:{
                label:"体重",
                data1:['体重','78.88','12.45','78.04','79.71','69.00','60.00','75.00','43.00','140.00'],
                data2:['体重','67.43','9.07','66.94','67.91','80.00','70.00','85.00','38.00','95.00'],
                data3:['<0.001','方差不齐']
            }},
            {name:'bmi',value:"lianxu",active:'',data:{
                label:"bmi",
                data1:['bmi','28.14','3.70','27.89','28.39','24.00','22.00','26.00','17.00','55.00'],
                data2:['bmi','23.85','2.31','23.72','23.97','28.00','26.00','30.00','15.00','27.00'],
                data3:['<0.001','方差不齐']
            }},
            {name:'甘油三酯',value:"lianxu",active:'',data:{
                label:"甘油三酯",
                data1:['甘油三酯','1.83','1.05','1.76','1.90','1.27','0.94','1.76','0.42','9.94'],
                data2:['甘油三酯','1.46','0.82','1.42','1.51','1.56','1.20','2.15','0.24','8.69'],
                data3:['<0.001','方差不齐']
            }},
            {name:'高密度脂蛋白',value:"lianxu",active:'',data:{
                label:"高密度脂蛋白",
                data1:['高密度脂蛋白','1.17','0.32','1.15','1.19','1.20','1.00','1.43','0.33','2.77'],
                data2:['高密度脂蛋白','1.22','0.34','1.21','1.24','1.14','0.95','1.34','0.28','2.89'],
                data3:['<0.001','方差不齐']
            }},
            {name:'低密度脂蛋白',value:"lianxu",active:'',data:{
                label:"低密度脂蛋白",
                data1:['低密度脂蛋白','2.63','0.94','2.57','2.69','2.35','1.78','2.99','0.60','6.52'],
                data2:['低密度脂蛋白','2.43','0.90','2.38','2.48','2.54','1.94','3.23','0.33','6.71'],
                data3:['<0.001','']
            }},
            {name:'总胆固醇',value:"lianxu",active:'',data:{
                label:"总胆固醇",
                data1:['总胆固醇','4.22','1.09','4.15','4.29','3.90','3.29','4.64','1.85','8.91'],
                data2:['总胆固醇','3.99','1.03','3.93','4.04','4.15','3.46','4.90','1.30','8.28'],
                data3:['<0.001','']
            }},
            {name:'纤维蛋白原',value:"lianxu",active:'',data:{
                label:"纤维蛋白原",
                data1:['纤维蛋白原','3.61','1.03','3.54','3.68','3.26','2.78','3.85','0.92','8.25'],
                data2:['纤维蛋白原','3.43','1.04','3.38','3.49','3.44','2.95','4.11','0.42','11.41'],
                data3:['<0.001','']
            }},
            {name:'国际标准化比值',value:"lianxu",active:'',data:{
                label:"国际标准化比值",
                data1:['国际标准化比值','1.01','0.13','1.00','1.02','1.01','0.96','1.06','0.82','2.91'],
                data2:['国际标准化比值','1.03','0.13','1.02','1.04','0.99','0.95','1.04','0.75','2.96'],
                data3:['<0.001','']
            }},
            {name:'糖化血红蛋白',value:"lianxu",active:'',data:{
                label:"糖化血红蛋白",
                data1:['糖化血红蛋白','7.49','1.91','7.36','7.62','5.80','5.40','6.30','3.80','13.40'],
                data2:['糖化血红蛋白','5.92','0.77','5.88','5.96','7.20','5.80','8.80','4.00','7.90'],
                data3:['<0.001','方差不齐']
            }},
            {name:'丙氨酸氨基转移酶',value:"lianxu",active:'',data:{
                label:"丙氨酸氨基转移酶",
                data1:['丙氨酸氨基转移酶','23.02','17.80','21.82','24.22','17.00','12.00','24.00','3.00','165.00'],
                data2:['丙氨酸氨基转移酶','21.74','21.13','20.60','22.88','18.00','13.00','28.00','1.00','362.00'],
                data3:['0.143','']
            }},
            {name:'肌酐',value:"lianxu",active:'',data:{
                label:"肌酐",
                data1:['肌酐','65.89','21.22','64.46','67.32','64.00','55.00','76.00','19.00','220.00'],
                data2:['肌酐','67.92','23.28','66.67','69.18','62.00','53.00','74.00','28.00','319.00'],
                data3:['0.040','']
            }},
            {name:'葡萄糖',value:"lianxu",active:'',data:{
                label:"葡萄糖",
                data1:['葡萄糖','8.09','3.46','7.86','8.33','5.45','4.87','6.50','3.61','25.50'],
                data2:['葡萄糖','5.92','1.69','5.83','6.01','7.05','5.38','9.87','1.82','21.31'],
                data3:['<0.001','方差不齐']
            }}
        ];
        $scope.tablesWuxu = [];

        $scope.tablesLianxu = [];

        $scope.selectedData = '';
        $scope.selectLeftData = '';
        $scope.selectLeft = function(){
            if( $scope.selectLeftData == 1 ){
                $scope.condition = [
                    {name:'性别',active:'infi-analysis-background',value:"wuxu",data: {
                        label:"性别",
                        data1:[
                            ['男','385','29.01%'],
                            ['女','942','70.99%']
                        ],
                        data2:[
                            ['0','279','32.90%'],
                            ['1','569','67.10%']
                        ],
                        data3:['3.688','0.055','1.200']


                    }},
                    {name:'高血压',active:'',value:"wuxu",data:{
                        label:"高血压",
                        data1:[
                            ['0','534','40.24%'],
                            ['1','793','59.76%']
                        ],
                        data2:[
                            ['0','275','32.43%'],
                            ['1','573','67.57%']
                        ],
                        data3:['13.516','<0.001','0.713']
                    }},
                    {name:'高脂血症',active:'',value:"wuxu",data:{
                        label:"高脂血症",
                        data1:[
                            ['1','1092','82.29%'],
                            ['2','235','17.71%']
                        ],
                        data2:[
                            ['1','676','79.72%'],
                            ['2','172','20.28%']
                        ],
                        data3:['2.253','0.133','0.846']
                    }},
                    {name: '糖尿病',active: '',value:"wuxu",data: {
                        label: '糖尿病',
                        data1: [
                            ['0','989','74.53%'],
                            ['1','407','48.00%']
                        ],
                        data2: [
                            ['0','338','25.47%'],
                            ['1','441','52.00%']
                        ],
                        data3:['158.453','<0.001','0.315']

                    }},
                    {
                        name:"吸烟史",
                        active:"",
                        value:"wuxu",
                        data:{
                            label:"吸烟史",
                            data1:[
                                ['0','746','56.22%'],
                                ['1','504','59.43%']
                            ],
                            data2:[
                                ['0','581','43.78%'],
                                ['1','344','40.57%']
                            ],
                            data3:['2.191','0.139','1.141']
                        }
                    },
                    {
                        name:"饮酒史",
                        active:"",
                        value:"wuxu",
                        data:{
                            label:"饮酒史",
                            data1:[
                                ['0','780','58.78%'],
                                ['1','547','41.22%']
                            ],
                            data2:[
                                ['0','522','61.56%'],
                                ['1','326','38.44%']
                            ],
                            data3:['1.661','0.197','1.123']
                        }
                    },
                    {
                        name:"阿托伐他汀_是否用药",
                        active:"",
                        value:"wuxu",
                        data:{
                            label:"阿托伐他汀_是否用药",
                            data1:[
                                ['0','371','27.96%'],
                                ['1','211','24.88%']
                            ],
                            data2:[
                                ['0','956','72.04%'],
                                ['1','637','75.12%']
                            ],
                            data3:['2.497','0.114','0.854']
                        }
                    },
                    {
                        name:"阿司匹林_是否用药",
                        active:"",
                        value:"wuxu",
                        data:{
                            label:"阿司匹林_是否用药",
                            data1:[
                                ['0','317','23.89%'],
                                ['1','1010','76.11%']
                            ],
                            data2:[
                                ['0','179','21.11%'],
                                ['1','669','78.89%']
                            ],
                            data3:['2.271','0.132','0.852']
                        }
                    },
                    {
                        name:"氯吡格雷_是否用药",
                        active:"",
                        value:"wuxu",
                        data:{
                            label:"阿司匹林_是否用药",
                            data1:[
                                ['0','491','37.00%'],
                                ['1','836','63.00%']
                            ],
                            data2:[
                                ['0','281','33.14%'],
                                ['1','567','66.86%']
                            ],
                            data3:['3.374','0.066','0.844']
                        }
                    },
                    {
                        name:"阿司匹林_是否用药",
                        active:"",
                        value:"wuxu",
                        data:{
                            label:"阿司匹林_是否用药",
                            data1:[
                                ['0','954','71.89%'],
                                ['1','373','28.11%']
                            ],
                            data2:[
                                ['0','572','67.45%'],
                                ['1','276','32.55%']
                            ],
                            data3:['4.869','0.027','0.810']
                        }
                    }
                ]
            }else if( $scope.selectLeftData == 2){
                $scope.condition = [
                    {name:'年龄',active:'infi-analysis-background',value:"lianxu",data:{
                        label:"年龄",
                        data1:['年龄','59.15','11.98','58.34','59.96','62.00','54.00','71.00','20.00','95.00'],
                        data2:['年龄','61.79','12.79','61.10','62.48','60.00','52.00','66.00','13.00','97.00'],
                        data3:['<0.001','方差不齐']
                    }},
                    {name:'住院天数',value:"lianxu",active:'',data:{
                        label:"住院天数",
                        data1:['住院天数','10.08','4.50','9.77','10.38','9.00','7.00','12.00','1.00','47.00'],
                        data2:['住院天数','9.94','4.71','9.68','10.19','9.00','7.00','12.00','1.00','62.00'],
                        data3:['0.490','']

                    }},
                    {name:'收缩压',value:"lianxu",active:'',data:{
                        label:"收缩压",
                        data1:['收缩压','147.19','21.59','145.73','148.64','140.00','130.00','159.00','94.00','230.00'],
                        data2:['收缩压','143.19','21.46','142.03','144.35','146.50','130.00','160.00','76.00','220.00'],
                        data3:['<0.001','']
                    }},
                    {name:'舒张压',value:"lianxu",active:'',data:{
                        label:"舒张压",
                        data1:['舒张压','86.05','12.66','85.20','86.91','80.00','75.00','90.00','53.00','140.00'],
                        data2:['舒张压','83.19','12.64','82.51','83.87','85.00','80.00','90.00','47.00','141.00'],
                        data3:['<0.001','']
                    }},
                    {name:'身高',value:"lianxu",active:'',data:{
                        label:"身高",
                        data1:['身高','167.27','7.81','166.74','167.80','170.00','162.00','173.00','130.00','190.00'],
                        data2:['身高','167.76','7.43','167.36','168.16','168.50','160.00','173.00','147.00','190.00'],
                        data3:['0.144','']
                    }},
                    {name:'体重',value:"lianxu",active:'',data:{
                        label:"体重",
                        data1:['体重','78.88','12.45','78.04','79.71','69.00','60.00','75.00','43.00','140.00'],
                        data2:['体重','67.43','9.07','66.94','67.91','80.00','70.00','85.00','38.00','95.00'],
                        data3:['<0.001','方差不齐']
                    }},
                    {name:'bmi',value:"lianxu",active:'',data:{
                        label:"bmi",
                        data1:['bmi','28.14','3.70','27.89','28.39','24.00','22.00','26.00','17.00','55.00'],
                        data2:['bmi','23.85','2.31','23.72','23.97','28.00','26.00','30.00','15.00','27.00'],
                        data3:['<0.001','方差不齐']
                    }},
                    {name:'甘油三酯',value:"lianxu",active:'',data:{
                        label:"甘油三酯",
                        data1:['甘油三酯','1.83','1.05','1.76','1.90','1.27','0.94','1.76','0.42','9.94'],
                        data2:['甘油三酯','1.46','0.82','1.42','1.51','1.56','1.20','2.15','0.24','8.69'],
                        data3:['<0.001','方差不齐']
                    }},
                    {name:'高密度脂蛋白',value:"lianxu",active:'',data:{
                        label:"高密度脂蛋白",
                        data1:['高密度脂蛋白','1.17','0.32','1.15','1.19','1.20','1.00','1.43','0.33','2.77'],
                        data2:['高密度脂蛋白','1.22','0.34','1.21','1.24','1.14','0.95','1.34','0.28','2.89'],
                        data3:['<0.001','方差不齐']
                    }},
                    {name:'低密度脂蛋白',value:"lianxu",active:'',data:{
                        label:"低密度脂蛋白",
                        data1:['低密度脂蛋白','2.63','0.94','2.57','2.69','2.35','1.78','2.99','0.60','6.52'],
                        data2:['低密度脂蛋白','2.43','0.90','2.38','2.48','2.54','1.94','3.23','0.33','6.71'],
                        data3:['<0.001','']
                    }},
                    {name:'总胆固醇',value:"lianxu",active:'',data:{
                        label:"总胆固醇",
                        data1:['总胆固醇','4.22','1.09','4.15','4.29','3.90','3.29','4.64','1.85','8.91'],
                        data2:['总胆固醇','3.99','1.03','3.93','4.04','4.15','3.46','4.90','1.30','8.28'],
                        data3:['<0.001','']
                    }},
                    {name:'纤维蛋白原',value:"lianxu",active:'',data:{
                        label:"纤维蛋白原",
                        data1:['纤维蛋白原','3.61','1.03','3.54','3.68','3.26','2.78','3.85','0.92','8.25'],
                        data2:['纤维蛋白原','3.43','1.04','3.38','3.49','3.44','2.95','4.11','0.42','11.41'],
                        data3:['<0.001','']
                    }},
                    {name:'国际标准化比值',value:"lianxu",active:'',data:{
                        label:"国际标准化比值",
                        data1:['国际标准化比值','1.01','0.13','1.00','1.02','1.01','0.96','1.06','0.82','2.91'],
                        data2:['国际标准化比值','1.03','0.13','1.02','1.04','0.99','0.95','1.04','0.75','2.96'],
                        data3:['<0.001','']
                    }},
                    {name:'糖化血红蛋白',value:"lianxu",active:'',data:{
                        label:"糖化血红蛋白",
                        data1:['糖化血红蛋白','7.49','1.91','7.36','7.62','5.80','5.40','6.30','3.80','13.40'],
                        data2:['糖化血红蛋白','5.92','0.77','5.88','5.96','7.20','5.80','8.80','4.00','7.90'],
                        data3:['<0.001','方差不齐']
                    }},
                    {name:'丙氨酸氨基转移酶',value:"lianxu",active:'',data:{
                        label:"丙氨酸氨基转移酶",
                        data1:['丙氨酸氨基转移酶','23.02','17.80','21.82','24.22','17.00','12.00','24.00','3.00','165.00'],
                        data2:['丙氨酸氨基转移酶','21.74','21.13','20.60','22.88','18.00','13.00','28.00','1.00','362.00'],
                        data3:['0.143','']
                    }},
                    {name:'肌酐',value:"lianxu",active:'',data:{
                        label:"肌酐",
                        data1:['肌酐','65.89','21.22','64.46','67.32','64.00','55.00','76.00','19.00','220.00'],
                        data2:['肌酐','67.92','23.28','66.67','69.18','62.00','53.00','74.00','28.00','319.00'],
                        data3:['0.040','']
                    }},
                    {name:'葡萄糖',value:"lianxu",active:'',data:{
                        label:"葡萄糖",
                        data1:['葡萄糖','8.09','3.46','7.86','8.33','5.45','4.87','6.50','3.61','25.50'],
                        data2:['葡萄糖','5.92','1.69','5.83','6.01','7.05','5.38','9.87','1.82','21.31'],
                        data3:['<0.001','方差不齐']
                    }}
                ]
            }else{
                $scope.condition = [
                    {name:'性别',active:'',value:"wuxu",data: {
                        label:"性别",
                        data1:[
                            ['男','385','29.01%'],
                            ['女','942','70.99%']
                        ],
                        data2:[
                            ['0','279','32.90%'],
                            ['1','569','67.10%']
                        ],
                        data3:['3.688','0.055','1.200']


                    }},
                    {name:'高血压',active:'',value:"wuxu",data:{
                        label:"高血压",
                        data1:[
                            ['0','534','40.24%'],
                            ['1','793','59.76%']
                        ],
                        data2:[
                            ['0','275','32.43%'],
                            ['1','573','67.57%']
                        ],
                        data3:['13.516','<0.001','0.713']
                    }},
                    {name:'高脂血症',active:'',value:"wuxu",data:{
                        label:"高脂血症",
                        data1:[
                            ['1','1092','82.29%'],
                            ['2','235','17.71%']
                        ],
                        data2:[
                            ['1','676','79.72%'],
                            ['2','172','20.28%']
                        ],
                        data3:['2.253','0.133','0.846']
                    }},
                    {name: '糖尿病',active: '',value:"wuxu",data: {
                        label: '糖尿病',
                        data1: [
                            ['0','989','74.53%'],
                            ['1','407','48.00%']
                        ],
                        data2: [
                            ['0','338','25.47%'],
                            ['1','441','52.00%']
                        ],
                        data3:['158.453','<0.001','0.315']

                    }},
                    {
                        name:"吸烟史",
                        active:"",
                        value:"wuxu",
                        data:{
                            label:"吸烟史",
                            data1:[
                                ['0','746','56.22%'],
                                ['1','504','59.43%']
                            ],
                            data2:[
                                ['0','581','43.78%'],
                                ['1','344','40.57%']
                            ],
                            data3:['2.191','0.139','1.141']
                        }
                    },
                    {
                        name:"饮酒史",
                        active:"",
                        value:"wuxu",
                        data:{
                            label:"饮酒史",
                            data1:[
                                ['0','780','58.78%'],
                                ['1','547','41.22%']
                            ],
                            data2:[
                                ['0','522','61.56%'],
                                ['1','326','38.44%']
                            ],
                            data3:['1.661','0.197','1.123']
                        }
                    },
                    {
                        name:"阿托伐他汀_是否用药",
                        active:"",
                        value:"wuxu",
                        data:{
                            label:"阿托伐他汀_是否用药",
                            data1:[
                                ['0','371','27.96%'],
                                ['1','211','24.88%']
                            ],
                            data2:[
                                ['0','956','72.04%'],
                                ['1','637','75.12%']
                            ],
                            data3:['2.497','0.114','0.854']
                        }
                    },
                    {
                        name:"阿司匹林_是否用药",
                        active:"",
                        value:"wuxu",
                        data:{
                            label:"阿司匹林_是否用药",
                            data1:[
                                ['0','317','23.89%'],
                                ['1','1010','76.11%']
                            ],
                            data2:[
                                ['0','179','21.11%'],
                                ['1','669','78.89%']
                            ],
                            data3:['2.271','0.132','0.852']
                        }
                    },
                    {
                        name:"氯吡格雷_是否用药",
                        active:"",
                        value:"wuxu",
                        data:{
                            label:"阿司匹林_是否用药",
                            data1:[
                                ['0','491','37.00%'],
                                ['1','836','63.00%']
                            ],
                            data2:[
                                ['0','281','33.14%'],
                                ['1','567','66.86%']
                            ],
                            data3:['3.374','0.066','0.844']
                        }
                    },
                    {
                        name:"阿司匹林_是否用药",
                        active:"",
                        value:"wuxu",
                        data:{
                            label:"阿司匹林_是否用药",
                            data1:[
                                ['0','954','71.89%'],
                                ['1','373','28.11%']
                            ],
                            data2:[
                                ['0','572','67.45%'],
                                ['1','276','32.55%']
                            ],
                            data3:['4.869','0.027','0.810']
                        }
                    },
                    {name:'年龄',active:'',value:"lianxu",data:{
                        label:"年龄",
                        data1:['年龄','59.15','11.98','58.34','59.96','62.00','54.00','71.00','20.00','95.00'],
                        data2:['年龄','61.79','12.79','61.10','62.48','60.00','52.00','66.00','13.00','97.00'],
                        data3:['<0.001','方差不齐']
                    }},
                    {name:'住院天数',value:"lianxu",active:'',data:{
                        label:"住院天数",
                        data1:['住院天数','10.08','4.50','9.77','10.38','9.00','7.00','12.00','1.00','47.00'],
                        data2:['住院天数','9.94','4.71','9.68','10.19','9.00','7.00','12.00','1.00','62.00'],
                        data3:['0.490','']

                    }},
                    {name:'收缩压',value:"lianxu",active:'',data:{
                        label:"收缩压",
                        data1:['收缩压','147.19','21.59','145.73','148.64','140.00','130.00','159.00','94.00','230.00'],
                        data2:['收缩压','143.19','21.46','142.03','144.35','146.50','130.00','160.00','76.00','220.00'],
                        data3:['<0.001','']
                    }},
                    {name:'舒张压',value:"lianxu",active:'',data:{
                        label:"舒张压",
                        data1:['舒张压','86.05','12.66','85.20','86.91','80.00','75.00','90.00','53.00','140.00'],
                        data2:['舒张压','83.19','12.64','82.51','83.87','85.00','80.00','90.00','47.00','141.00'],
                        data3:['<0.001','']
                    }},
                    {name:'身高',value:"lianxu",active:'',data:{
                        label:"身高",
                        data1:['身高','167.27','7.81','166.74','167.80','170.00','162.00','173.00','130.00','190.00'],
                        data2:['身高','167.76','7.43','167.36','168.16','168.50','160.00','173.00','147.00','190.00'],
                        data3:['0.144','']
                    }},
                    {name:'体重',value:"lianxu",active:'',data:{
                        label:"体重",
                        data1:['体重','78.88','12.45','78.04','79.71','69.00','60.00','75.00','43.00','140.00'],
                        data2:['体重','67.43','9.07','66.94','67.91','80.00','70.00','85.00','38.00','95.00'],
                        data3:['<0.001','方差不齐']
                    }},
                    {name:'bmi',value:"lianxu",active:'',data:{
                        label:"bmi",
                        data1:['bmi','28.14','3.70','27.89','28.39','24.00','22.00','26.00','17.00','55.00'],
                        data2:['bmi','23.85','2.31','23.72','23.97','28.00','26.00','30.00','15.00','27.00'],
                        data3:['<0.001','方差不齐']
                    }},
                    {name:'甘油三酯',value:"lianxu",active:'',data:{
                        label:"甘油三酯",
                        data1:['甘油三酯','1.83','1.05','1.76','1.90','1.27','0.94','1.76','0.42','9.94'],
                        data2:['甘油三酯','1.46','0.82','1.42','1.51','1.56','1.20','2.15','0.24','8.69'],
                        data3:['<0.001','方差不齐']
                    }},
                    {name:'高密度脂蛋白',value:"lianxu",active:'',data:{
                        label:"高密度脂蛋白",
                        data1:['高密度脂蛋白','1.17','0.32','1.15','1.19','1.20','1.00','1.43','0.33','2.77'],
                        data2:['高密度脂蛋白','1.22','0.34','1.21','1.24','1.14','0.95','1.34','0.28','2.89'],
                        data3:['<0.001','方差不齐']
                    }},
                    {name:'低密度脂蛋白',value:"lianxu",active:'',data:{
                        label:"低密度脂蛋白",
                        data1:['低密度脂蛋白','2.63','0.94','2.57','2.69','2.35','1.78','2.99','0.60','6.52'],
                        data2:['低密度脂蛋白','2.43','0.90','2.38','2.48','2.54','1.94','3.23','0.33','6.71'],
                        data3:['<0.001','']
                    }},
                    {name:'总胆固醇',value:"lianxu",active:'',data:{
                        label:"总胆固醇",
                        data1:['总胆固醇','4.22','1.09','4.15','4.29','3.90','3.29','4.64','1.85','8.91'],
                        data2:['总胆固醇','3.99','1.03','3.93','4.04','4.15','3.46','4.90','1.30','8.28'],
                        data3:['<0.001','']
                    }},
                    {name:'纤维蛋白原',value:"lianxu",active:'',data:{
                        label:"纤维蛋白原",
                        data1:['纤维蛋白原','3.61','1.03','3.54','3.68','3.26','2.78','3.85','0.92','8.25'],
                        data2:['纤维蛋白原','3.43','1.04','3.38','3.49','3.44','2.95','4.11','0.42','11.41'],
                        data3:['<0.001','']
                    }},
                    {name:'国际标准化比值',value:"lianxu",active:'',data:{
                        label:"国际标准化比值",
                        data1:['国际标准化比值','1.01','0.13','1.00','1.02','1.01','0.96','1.06','0.82','2.91'],
                        data2:['国际标准化比值','1.03','0.13','1.02','1.04','0.99','0.95','1.04','0.75','2.96'],
                        data3:['<0.001','']
                    }},
                    {name:'糖化血红蛋白',value:"lianxu",active:'',data:{
                        label:"糖化血红蛋白",
                        data1:['糖化血红蛋白','7.49','1.91','7.36','7.62','5.80','5.40','6.30','3.80','13.40'],
                        data2:['糖化血红蛋白','5.92','0.77','5.88','5.96','7.20','5.80','8.80','4.00','7.90'],
                        data3:['<0.001','方差不齐']
                    }},
                    {name:'丙氨酸氨基转移酶',value:"lianxu",active:'',data:{
                        label:"丙氨酸氨基转移酶",
                        data1:['丙氨酸氨基转移酶','23.02','17.80','21.82','24.22','17.00','12.00','24.00','3.00','165.00'],
                        data2:['丙氨酸氨基转移酶','21.74','21.13','20.60','22.88','18.00','13.00','28.00','1.00','362.00'],
                        data3:['0.143','']
                    }},
                    {name:'肌酐',value:"lianxu",active:'',data:{
                        label:"肌酐",
                        data1:['肌酐','65.89','21.22','64.46','67.32','64.00','55.00','76.00','19.00','220.00'],
                        data2:['肌酐','67.92','23.28','66.67','69.18','62.00','53.00','74.00','28.00','319.00'],
                        data3:['0.040','']
                    }},
                    {name:'葡萄糖',value:"lianxu",active:'',data:{
                        label:"葡萄糖",
                        data1:['葡萄糖','8.09','3.46','7.86','8.33','5.45','4.87','6.50','3.61','25.50'],
                        data2:['葡萄糖','5.92','1.69','5.83','6.01','7.05','5.38','9.87','1.82','21.31'],
                        data3:['<0.001','方差不齐']
                    }}
                ]
            }
        };
        $scope.conditionClick = function(data){
            var chartOption1;
            var chartOption2;
            var chartContinuity1;
            var chartContinuity2;
            if(data.active){
                data.active = '';
                if($scope.selectedData.indexOf(data.name)>-1){

                    $scope.selectedData = $scope.selectedData.replace(data.name+' , ','');
                }
                if(data.value=='wuxu'){
                    angular.forEach($scope.tablesWuxu,function (table,index) {
                        if( table.label == data.name ){
                            $scope.tablesWuxu.splice(index,1);
                            return false;
                        }
                    })
                }else{
                    angular.forEach($scope.tablesLianxu,function(teble,index){
                        if(teble.label==data.name){
                            $scope.tablesLianxu.splice(index,1);
                        }
                    })
                }

            }else{
                data.active = 'infi-analysis-background';
                $scope.selectedData = data.name+' , '+ $scope.selectedData;
                if(data.value=='wuxu'){
                    var ss = angular.copy(data.data.data1);
                    for(var i = 0;i<data.data.data2.length;i++){
                        for(var j=0;j<data.data.data2[i].length;j++){
                            ss[i].push(data.data.data2[i][j])
                        }
                    }
                    for(var index = 0;index<ss.length;index++){
                        var sh = ss[index];
                        sh.splice(3,1);
                    }
                    data.data.datas = ss;
                    $scope.tablesWuxu.push(data.data);
                    data.type = 'bar';
                    chartOption1 = genOption1(data);
                    chartOption2 = genOption2(data);
                    data.option = chartOption1;
                    drawChart(chartOption1,'wuxu_left_'+data.name);
                    drawChart(chartOption2,'wuxu_right_'+data.name);

                }else{
                    $scope.tablesLianxu.push(data.data);
                    var zz = angular.copy(data.data.data1);
                    for(var idx = 0;idx<data.data.data2.length;idx++){
                        zz.push(data.data.data2[idx])
                    }
                    zz.splice(10,1);
                    data.type='shadow';
                    data.data.datas = zz;
                    chartContinuity1 = getoptionss1(data);
                    chartContinuity2 = getoptionss2(data);
                    data.option = chartContinuity1;
                    drawChart(chartContinuity1,'lianxu_left_'+data.name);
                    drawChart(chartContinuity2,'lianxu_right_'+data.name);
                }
            }

        };
        $scope.conditionClick($scope.condition[0]);
        $scope.conditionClick($scope.condition[10]);
        $scope.switch = function(data,type,position){
            var chartOption;
            datas={
                name:data.label,
                value:"wuxu",
                data:data
            };
            datas.type = type;
            if( type == 'bar'){
                if(position=='left'){
                    chartOption = genOption1(datas);
                }else{
                    chartOption = genOption2(datas);
                }
                }else if(type == 'pie'){
                if(position=='left'){
                    $scope.aaa = [];
                    for(var i = 0 ; i < data.data1.length ; i++){
                        $scope.aaa.push({value:data.data1[i][1],name:data.data1[i][0]});
                    }
                    chartOption =  {
                        tooltip : {
                            trigger: 'item',
                            formatter: "{a} <br/>{b} : {c} ({d}%)"
                        },
                        series : [
                            {
                                name: '访问来源',
                                type: 'pie',
                                radius : '55%',
                                center: ['50%', '40%'],
                                data:$scope.aaa,
                                itemStyle: {
                                    emphasis: {
                                        shadowBlur: 10,
                                        shadowOffsetX: 0,
                                        shadowColor: 'rgba(0, 0, 0, 0.5)'
                                    }
                                }
                            }
                        ]
                    };
                }else{
                    $scope.pies = [];
                    for(var j = 0 ; j < data.data2.length ; j++){
                        $scope.pies.push({value:data.data2[j][1],name:data.data2[j][0]});
                    }
                    chartOption =  {
                        tooltip : {
                            trigger: 'item',
                            formatter: "{a} <br/>{b} : {c} ({d}%)"
                        },
                        series : [
                            {
                                name: '访问来源',
                                type: 'pie',
                                radius : '55%',
                                center: ['50%', '40%'],
                                data:$scope.pies,
                                itemStyle: {
                                    emphasis: {
                                        shadowBlur: 10,
                                        shadowOffsetX: 0,
                                        shadowColor: 'rgba(0, 0, 0, 0.5)'
                                    }
                                }
                            }
                        ]
                    };
                }
            }
            if(position=='left'){
                drawChart(chartOption,'wuxu_left_'+datas.name);
            }else{
                drawChart(chartOption,'wuxu_right_'+datas.name);
            }


        };

        function genPieOption(table){
            var option = {
                title: {
                    text: table.name
                },
                tooltip: {},
                xAxis: {
                    data: []
                },
                yAxis: {},
                series: [{
                    name: table.name,
                    type: table.type,
                    barWidth:'35%',
                    data: []
                }]
            };
            var idx=0;
            var entity;
            option.xAxis.data = [];
            option.series[0].data = [];
            for(idx=0;idx<table.data.data.length;idx++){
                entity=table.data.data[idx];
                option.xAxis.data.push(entity[0]);
                option.series[0].data.push(entity[1]);
            }
            return option;
        }

        function genOption1(table){
            var option = {
                title: {
                    text: table.name+'[实验组]'
                },
                tooltip: {},
                xAxis: {
                    data: []
                },
                yAxis: {},
                series: [{
                    name: table.name,
                    type: table.type,
                    barWidth:'50%',
                    data: []
                }]
            };
            var idx=0;
            var entity;
            option.xAxis.data = [];
            option.series[0].data = [];
            for(idx=0;idx<table.data.data1.length;idx++){
                entity=table.data.data1[idx];
                option.xAxis.data.push(entity[0]);
                option.series[0].data.push(entity[1]);
            }
            return option;
        }

        function genOption2(table){
            var option = {
                title: {
                    text: table.name+'[对照组]'
                },
                tooltip: {},
                xAxis: {
                    data: []
                },
                yAxis: {},
                series: [{
                    name: table.name,
                    type: table.type,
                    barWidth:'50%',
                    data: []
                }]
            };
            var idx=0;
            var entity;
            option.xAxis.data = [];
            option.series[0].data = [];
            for(idx=0;idx<table.data.data2.length;idx++){
                entity=table.data.data2[idx];
                option.xAxis.data.push(entity[0]);
                option.series[0].data.push(entity[1]);
            }
            return option;
        }

        function drawChart(option,id){
            setTimeout(function () {
                myChart = echarts.init(document.getElementById(id));
                myChart.clear();
                myChart.setOption(option);
            },100)
        }


        function getoptionss1(table){
            var tables = angular.copy(table);
            tables.data.data1.splice(0,1);
            $scope.wraps = [];
            $scope.wraps.push(tables.data.data1);
            var data = echarts.dataTool.prepareBoxplotData($scope.wraps);
            var optionsMain = {
                title: {
                    text: table.name+'[实验组]'
                },
                tooltip: {
                    trigger: 'item',
                    axisPointer: {
                        type: 'shadow'
                    }
                },
                grid: {
                    left: '10%',
                    right: '10%',
                    bottom: '15%'
                },
                xAxis: {
                    type: 'category',
                    data: data.axisData,
                    boundaryGap: true,
                    nameGap: 30,
                    splitArea: {
                        show: false
                    },
                    axisLabel: {
                        formatter: table.name
                    },
                    splitLine: {
                        show: false
                    }
                },
                yAxis: {
                    type: 'value',
                    splitArea: {
                        show: true
                    }
                },
                series: [
                    {
                        name: 'boxplot',
                        type: 'boxplot',
                        data: data.boxData,
                        tooltip: {
                            formatter: function (param) {
                                return [
                                    'Experiment ' + param.name + ': ',
                                    'upper: ' + param.data[4],
                                    'Q3: ' + param.data[3],
                                    'median: ' + param.data[2],
                                    'Q1: ' + param.data[1],
                                    'lower: ' + param.data[0]
                                ].join('<br/>')
                            }
                        }
                    },
                    {
                        name: 'outlier',
                        type: 'scatter',
                        data: data.outliers
                    }
                ]
            };
            return optionsMain;
        }

        function getoptionss2(table){
            var tables = angular.copy(table);
            tables.data.data2.splice(0,1);
            $scope.wraps = [];
            $scope.wraps.push(tables.data.data2);
            var data = echarts.dataTool.prepareBoxplotData($scope.wraps);
            var optionsMain = {
                title: {
                    text: table.name+'[对照组]'
                },
                tooltip: {
                    trigger: 'item',
                    axisPointer: {
                        type: 'shadow'
                    }
                },
                grid: {
                    left: '10%',
                    right: '10%',
                    bottom: '15%'
                },
                xAxis: {
                    type: 'category',
                    data: data.axisData,
                    boundaryGap: true,
                    nameGap: 30,
                    splitArea: {
                        show: false
                    },
                    axisLabel: {
                        formatter: table.name
                    },
                    splitLine: {
                        show: false
                    }
                },
                yAxis: {
                    type: 'value',
                    splitArea: {
                        show: true
                    }
                },
                series: [
                    {
                        name: 'boxplot',
                        type: 'boxplot',
                        data: data.boxData,
                        tooltip: {
                            formatter: function (param) {
                                return [
                                    'Experiment ' + param.name + ': ',
                                    'upper: ' + param.data[4],
                                    'Q3: ' + param.data[3],
                                    'median: ' + param.data[2],
                                    'Q1: ' + param.data[1],
                                    'lower: ' + param.data[0]
                                ].join('<br/>')
                            }
                        }
                    },
                    {
                        name: 'outlier',
                        type: 'scatter',
                        data: data.outliers
                    }
                ]
            };
            return optionsMain;
        }


        $scope.swithBottom = function(data,type,position){
            var chartOption;
            datas = {
                name:data.label,
                value:'lianxu',
                data:data
            }
            if(type == 'shadow' ){
                if(position == 'left'){
                    chartOption = getoptionss1(datas)
                }else{
                    chartOption = getoptionss2(datas)
                }

            }else{
                if(position == 'right'){
                    datas.name = data.label
                    var dataAll = [
                        [
                            [10.0, 8.04],
                            [8.0, 6.95],
                            [13.0, 7.58],
                            [9.0, 8.81],
                            [11.0, 8.33],
                            [14.0, 9.96],
                            [6.0, 7.24],
                            [4.0, 4.26],
                            [12.0, 10.84],
                            [7.0, 4.82],
                            [5.0, 5.68]
                        ]
                    ];

                    var markLineOpt = {
                        animation: false,
                        label: {
                            normal: {
                                formatter: 'y = 0.5 * x + 3',
                                textStyle: {
                                    align: 'right'
                                }
                            }
                        },
                        lineStyle: {
                            normal: {
                                type: 'solid'
                            }
                        },
                        tooltip: {
                            formatter: 'y = 0.5 * x + 3'
                        },
                        data: [[{
                            coord: [0, 3],
                            symbol: 'none'
                        }, {
                            coord: [20, 13],
                            symbol: 'none'
                        }]]
                    };
                    var chartOption = {
                        title: {
                            text: datas.name+'[对照组]',
                            x: 'left',
                            y: 0
                        },
                        grid: [
                            {x: '7%', y: '7%', width: '80%', height: '80%'}
                        ],
                        tooltip: {
                            formatter: 'Group {a}: ({c})'
                        },
                        xAxis: [
                            {gridIndex: 0, min: 0, max: 20}
                        ],
                        yAxis: [
                            {gridIndex: 0, min: 0, max: 15}
                        ],
                        series: [
                            {
                                name: 'I',
                                type: 'scatter',
                                xAxisIndex: 0,
                                yAxisIndex: 0,
                                data: dataAll[0],
                                markLine: markLineOpt
                            }
                        ]
                    };
                }else{
                    datas.name = data.label
                    var dataAll = [
                        [
                            [10.0, 8.04],
                            [8.0, 6.95],
                            [13.0, 7.58],
                            [9.0, 8.81],
                            [11.0, 8.33],
                            [14.0, 9.96],
                            [6.0, 7.24],
                            [4.0, 4.26],
                            [12.0, 10.84],
                            [7.0, 4.82],
                            [5.0, 5.68]
                        ]
                    ];

                    var markLineOpt = {
                        animation: false,
                        label: {
                            normal: {
                                formatter: 'y = 0.5 * x + 3',
                                textStyle: {
                                    align: 'right'
                                }
                            }
                        },
                        lineStyle: {
                            normal: {
                                type: 'solid'
                            }
                        },
                        tooltip: {
                            formatter: 'y = 0.5 * x + 3'
                        },
                        data: [[{
                            coord: [0, 3],
                            symbol: 'none'
                        }, {
                            coord: [20, 13],
                            symbol: 'none'
                        }]]
                    };
                    var chartOption = {
                        title: {
                            text: datas.name+'[实验组]',
                            x: 'left',
                            y: 0
                        },
                        grid: [
                            {x: '7%', y: '7%', width: '80%', height: '80%'}
                        ],
                        tooltip: {
                            formatter: 'Group {a}: ({c})'
                        },
                        xAxis: [
                            {gridIndex: 0, min: 0, max: 20}
                        ],
                        yAxis: [
                            {gridIndex: 0, min: 0, max: 15}
                        ],
                        series: [
                            {
                                name: 'I',
                                type: 'scatter',
                                xAxisIndex: 0,
                                yAxisIndex: 0,
                                data: dataAll[0],
                                markLine: markLineOpt
                            }
                        ]
                    };
                }

            }
            if(position =='left'){
                drawChart(chartOption,'lianxu_left_'+datas.name);
            }else{
                drawChart(chartOption,'lianxu_right_'+datas.name);
            }

        };

    }]);